Базово у героя 100 хп и 20 урона.

### Основной геймплей
#Стиль - JRPG (последовательный бой)
## Во время боя: 
# Способности героя:
- Бить (-хп врагу, есть случ. криты)
- Поговорить (у врага есть шкала удобрения, во время действия "говорить" она заполняется на случайный процент, когда шкала заполнится - бой выигран)
- Юзануть зелье (+урон, +реген)
- Свалить (после следующего хода противника бой заканчивается)

карта как в Inscription (естественно в 2D)
## Объекты на карте:
# Данж 👿
- Только враги, в конце лут
# Поселение 🏠
- Магазин и тут же регенятся все хп
# Случайные события ❓
- Обмен предмета на случайный
- Казик (даёшь деньги и есть шанс выиграть больше)
- Внезапный враг!
- Костёр с регеном хп


## Предметы:
# Точильный камень
~ +5 урона
# Огненный меч
~ +10 урона
# Потранташ зелий
~ +10 хп
# Калоши Ориона
~ +30 хп
# Пояс верности
~ -5 хп, +5 урон
# Хрустальный клинок
~ +40 урона, -50 хп
